---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.Product
source: html/0c84ac5e-2054-a785-5551-e4eeb849b690.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.Product Property

The product type for the current session of Revit.

## Syntax (C#)
```csharp
public ProductType Product { get; }
```